[Killed] BlockStatement
src/application/TransferenciaServico.ts:15:69
         this._repositorio = repositorio;
     }
 
-    public async transferir(dto: TransferenciaDTO): Promise<string> {
-        const contaOrigem = await this._repositorio.buscar(dto.contaOrigem);
-        const contaDestino = await this._repositorio.buscar(dto.contaDestino);
-
-        if (contaOrigem === undefined)
-            throw new NegocioErro("conta de origem não encontrada");
-        
-        if (contaDestino === undefined)
-            throw new NegocioErro("conta de destino não encontrada");
-
-        const transferencia: TransferenciaValor = new TransferenciaValor();
-        const recibo: Recibo = transferencia.transferir(contaOrigem!, contaDestino!, dto.valor);
-
-        this._repositorio.adicionar(contaOrigem!);
-        this._repositorio.adicionar(contaDestino!);
-
-        return recibo.codigo;
-    }
+    public async transferir(dto: TransferenciaDTO): Promise<string> {}
 }
killedBy: Transferencia Servico Mock transferir com sucesso
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "123456"

Number of calls: 0

[Killed] ConditionalExpression
src/application/TransferenciaServico.ts:19:13
         const contaOrigem = await this._repositorio.buscar(dto.contaOrigem);
         const contaDestino = await this._repositorio.buscar(dto.contaDestino);
 
-        if (contaOrigem === undefined)
+        if (true)
             throw new NegocioErro("conta de origem não encontrada");
         
killedBy: Transferencia Servico Mock transferir com sucesso
statusReason: Error: conta de origem não encontrada

[Killed] ConditionalExpression
src/application/TransferenciaServico.ts:22:13
         if (contaOrigem === undefined)
             throw new NegocioErro("conta de origem não encontrada");
         
-        if (contaDestino === undefined)
+        if (false)
             throw new NegocioErro("conta de destino não encontrada");
 
killedBy: Transferencia Servico Mock conta de destino não encontrada
statusReason: Error: expect(received).rejects.toEqual(expected) // deep equality

Expected: [Error: conta de destino não encontrada]
Received: [TypeError: Cannot read properties of undefined (reading 'depositar')]
