[Killed] BlockStatement
src/model/Conta.ts:13:38
         this._saldo = saldo;
     }
 
-    public sacar(valor: number): void{ 
-        this.validarValor(valor);
- 
-        if((this._saldo - valor) < 0){
-            throw new NegocioErro("saldo indisponível para operação");
-        }
-
-        this._saldo -= valor;
-    }
+    public sacar(valor: number): void{}
 
     public depositar(valor: number): void{
killedBy: Transferencia Servico Mock transferir com sucesso
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4900
Received: 5000

[Killed] ConditionalExpression
src/model/Conta.ts:16:12
     public sacar(valor: number): void{ 
         this.validarValor(valor);
  
-        if((this._saldo - valor) < 0){
+        if(false){
             throw new NegocioErro("saldo indisponível para operação");
         }
killedBy: Conta sacar com valor acima do saldo
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "saldo indisponível para operação"

Received function did not throw

[Killed] EqualityOperator
src/model/Conta.ts:16:12
     public sacar(valor: number): void{ 
         this.validarValor(valor);
  
-        if((this._saldo - valor) < 0){
+        if(this._saldo - valor <= 0){
             throw new NegocioErro("saldo indisponível para operação");
         }
killedBy: Conta sacar todo o saldo
statusReason: Error: saldo indisponível para operação

[Killed] EqualityOperator
src/model/Conta.ts:37:12
     }
 
     private validarValor(valor: number): void{
-        if(valor <= 0){
+        if(valor < 0){
             throw new NegocioErro("valor não pode ser igual ou menor que zero");
         }
killedBy: Conta sacar com valor zerado
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "valor não pode ser igual ou menor que zero"

Received function did not throw

[Killed] ConditionalExpression
src/model/Conta.ts:37:12
     }
 
     private validarValor(valor: number): void{
-        if(valor <= 0){
+        if(true){
             throw new NegocioErro("valor não pode ser igual ou menor que zero");
         }
killedBy: Transferencia Servico Mock transferir com sucesso
statusReason: Error: valor não pode ser igual ou menor que zero
