[Killed] BlockStatement
src/model/NumeroConta.ts:12:41
     }
 
     private validar(numero: string): void{
-        if(!this.temSeisDigitos(numero)){
-            throw new NegocioErro("número de conta inválida");
-        }
+        if(!this.temSeisDigitos(numero)){}
     }
 
killedBy: Número Conta número de conta com cinco digitos
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "número de conta inválida"

Received function did not throw

[Killed] BlockStatement
src/model/NumeroConta.ts:17:52
         }
     }
 
-    private temSeisDigitos(numero: string): boolean{
-        const regexp: RegExp = /^\d{6}$/;
-        return regexp.test(numero);
-    }
+    private temSeisDigitos(numero: string): boolean{}
 
     public get numero(): string {
killedBy: Conta sacar com sucesso
statusReason: Error: número de conta inválida

[Killed] Regex
src/model/NumeroConta.ts:18:32
     }
 
     private temSeisDigitos(numero: string): boolean{
-        const regexp: RegExp = /^\d{6}$/;
+        const regexp: RegExp = /\d{6}$/;
         return regexp.test(numero);
     }
killedBy: Número Conta número de conta com sete digitos
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "número de conta inválida"

Received function did not throw

[Killed] Regex
src/model/NumeroConta.ts:18:32
     }
 
     private temSeisDigitos(numero: string): boolean{
-        const regexp: RegExp = /^\d{6}$/;
+        const regexp: RegExp = /^\d$/;
         return regexp.test(numero);
     }
killedBy: Transferencia Servico Mock transferir com sucesso
statusReason: Error: número de conta inválida
